import { GameItem } from './types';

export const GAME_DATA: GameItem[] = [
  {
    id: 'q1',
    question: 'เหตุการณ์ที่เหรียญออกก้อย 1 ครั้ง จากการโยนเหรียญบาท 1 เหรียญ 2 ครั้ง',
    answer: 'HT, TH'
  },
  {
    id: 'q2',
    question: 'ผลลัพธ์ทั้งหมดที่เกิดขึ้นจากการโยนเหรียญบาท 2 เหรียญ 1 ครั้ง',
    answer: 'HH, HT, TH, TT'
  },
  {
    id: 'q3',
    question: 'ผลลัพธ์ทั้งหมดที่เกิดขึ้นจากการทอดลูกเต๋า 1 ลูก 1 ครั้ง',
    answer: '1, 2, 3, 4, 5, 6'
  },
  {
    id: 'q4',
    question: 'ความน่าจะเป็นของเหตุการณ์หยิบได้ไพ่ที่มีหน้าเป็น 5 จากการสุ่มหยิบไพ่ 1 ใบ ใน 1 สำรับ',
    answer: '1/13'
  },
  {
    id: 'q5',
    question: 'ความน่าจะเป็นของเหตุการณ์ที่หยิบได้กะละแมรสใบเตย จากตะกร้าที่มีกะละแมรสสตรอเบอรี่ 6 ชิ้น รสใบเตย 10 ชิ้น และรสทุเรียน 12 ชิ้น',
    answer: '5/14'
  },
  {
    id: 'q6',
    question: 'ไขได้ลูกปัดสีเขียว จากตู้ที่มีลูกปัด 20 ลูก เป็นสีเขียวทั้งหมด',
    answer: 'เกิดขึ้นอย่างแน่นอน'
  },
  {
    id: 'q7',
    question: 'หยิบได้ลูกอมรสมะนาว จากกระปุกที่มีลูกอมรสมะขาม รสสับปะรด และรสลิ้นจี่',
    answer: 'ไม่เกิดขึ้นอย่างแน่นอน'
  },
  {
    id: 'q8',
    question: 'เหตุการณ์ที่ลูกเต๋าหงายขึ้นแต้มคี่ จากการทอดลูกเต๋า 1 ลูก 1 ครั้ง',
    answer: '1, 3, 5'
  },
  {
    id: 'q9',
    question: 'หยิบได้ลูกปิงปองสีขาว จากโหลที่มีลูกปิงปองสีขาวและสีชมพูอย่างละ 3 ลูก',
    answer: 'อาจจะเกิดขึ้นหรือไม่ก็ได้'
  },
  {
    id: 'q10',
    question: 'ความน่าจะเป็นของเหตุการณ์ที่ไขได้ลูกอมสีฟ้า จากตู้ที่มีลูกอมสีเขียว 10 ลูก สีฟ้า 15 ลูก',
    answer: '3/5'
  }
];